app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])  #assigns the artist based on the artist_id passed in through songs params
      if !@artist.nil?
        @songs = @artist.songs  #assigns @songs for the songs that belong_to that artist.
      else
        redirect_to artists_path, notice: "Artist not found"
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
      @song = @artist.songs.find_by_id(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]